# Access Controls.Json


{
  "implemented-requirements": [
    {
      "uuid": "5c1c3c8d-8dbb-4e09-874d-5a1d376c3b22",
      "control-id": "IAC-01.3",
      "description": "Automated mechanisms are implemented to maintain a current list of authorized users and service accounts by integrating a user management system that regularly audits user accounts against the organizational policy. This includes automated reporting features to notify administrators of any discrepancies."
    },
    {
      "uuid": "b8c8bfe7-1434-4d45-bc6a-7207bbf0c182",
      "control-id": "IAC-02",
      "description": "The software utilizes a centralized authentication service that implements OAuth 2.0 for user identity verification, ensuring all organizational users are uniquely identified and can be audited through access logs."
    },
    {
      "uuid": "e0b8a2f5-384b-47e0-baf2-3c19e8a8c1d7",
      "control-id": "IAC-02.2",
      "description": "The implementation of replay-resistant authentication is achieved through nonce generation and timestamp validation within the authentication tokens provided by the centralized authentication service."
    },
    {
      "uuid": "e04e0b4c-660a-4e5d-b626-34c1b74b8b2b",
      "control-id": "IAC-03",
      "description": "Third-party users are authenticated through a separate OAuth 2.0 flow that requires additional verification steps, ensuring a secure method for identifying and authorizing external users."
    },
    {
      "uuid": "b7e2c0b9-1e7f-4b1a-b8f4-bc8d6dbd1f0a",
      "control-id": "IAC-04",
      "description": "Bidirectional authentication for devices is enforced by requiring device certificates signed by a trusted authority, which must be presented during the connection establishment process."
    },
    {
      "uuid": "c3d9d4f0-0a1b-4d82-9d7e-c2f9d3e2d8f8",
      "control-id": "IAC-04.1",
      "description": "The system ensures accurate device identification by implementing a device enrollment process that requires devices to register through a controlled domain management system before accessing network resources."
    },
    {
      "uuid": "2b52a6b1-2a77-4e1b-b2f0-af0c4b58a7ee",
      "control-id": "IAC-06",
      "description": "Multi-Factor Authentication (MFA) is enforced for all remote access and critical system access by requiring users to authenticate using both a password and a time-based one-time password (TOTP) generated by an authentication app."
    },
    {
      "uuid": "edc824e1-0d3e-4f09-bc0f-eb5f229c81c1",
      "control-id": "IAC-08",
      "description": "Role-Based Access Control (RBAC) is implemented through a centralized access control list that assigns permissions based on user roles, ensuring that only authorized users have access to sensitive data."
    },
    {
      "uuid": "a2c1b2e4-9b71-4bf9-bb56-2a5b166f2f8d",
      "control-id": "IAC-13.1",
      "description": "A Single Sign-On (SSO) capability is provided through the integration of an Identity Provider (IdP) that handles authentication requests, allowing users to access multiple systems with a single set of credentials."
    },
    {
      "uuid": "b5f6a9f1-1a1f-4b3a-bd77-662c0d6f2f3f",
      "control-id": "IAC-16",
      "description": "Privileged Account Management (PAM) is implemented by restricting access to privileged accounts through approval workflows and ensuring that these accounts are monitored and reviewed regularly."
    },
    {
      "uuid": "c3e6a6d1-9f7a-4b77-8c8e-60d3b70f1d2f",
      "control-id": "IAC-20",
      "description": "Logical Access Control (LAC) permissions are enforced by implementing a principle of least privilege in the access control system, where users are only granted access rights necessary for their roles."
    },
    {
      "uuid": "c6e1f8b1-3c5d-4f1b-bcc5-0b2c249a3f0e",
      "control-id": "IAC-21",
      "description": "The concept of least privilege is utilized by ensuring that all users and processes can only access resources that are essential for their job functions, with regular audits of access rights."
    },
    {
      "uuid": "a2b8f5a4-8c59-4c8f-9d1c-5f3b4b3f8c38",
      "control-id": "IAC-21.3",
      "description": "Privileged account assignments are restricted to users approved by management, with a formal approval process required before granting any privileged access."
    },
    {
      "uuid": "f5b1c8e4-0e84-4e2b-bf2e-7b4e8b4f8eef",
      "control-id": "IAC-22",
      "description": "An account lockout mechanism is enforced by limiting consecutive invalid login attempts to five within a 15-minute window, automatically locking accounts that exceed this limit."
    },
    {
      "uuid": "a9b3c7f1-4b1a-4b1a-8c6c-2e0e3b3c9e7a",
      "control-id": "IAC-23",
      "description": "The system limits the number of concurrent sessions per user account to a maximum of two, which is enforced at the application layer to prevent session hijacking."
    },
    {
      "uuid": "2c3d4b5e-1a7b-4c3a-bd9f-4c5e6b2f7e8a",
      "control-id": "IAC-29",
      "description": "Attribute-Based Access Control (ABAC) is enforced through policies that dynamically evaluate user attributes and resource attributes, allowing for fine-grained access control based on context."
    }
  ]
}
