# Access Controls.Json


{
  "implemented-requirements": [
    {
      "uuid": "d5b8aef1-8a4a-4a57-8f43-2c7e0c7a1e8f",
      "control-id": "IAC-01.3",
      "description": "Automated scripts are implemented to regularly query the user management database and generate a current list of authorized users and service accounts. This list is stored in a secure location with access restricted to authorized personnel only."
    },
    {
      "uuid": "4a8c7e7b-3f5e-4a1e-9c68-d2fdfc8e3c5d",
      "control-id": "IAC-02",
      "description": "The software utilizes a centralized authentication service that employs unique identifiers for all organizational users. It integrates seamlessly with the existing LDAP directory services for authentication, authorization, and auditing (AAA) processes."
    },
    {
      "uuid": "fb6debb0-3c9f-4b20-a3e0-1384dc0f5b7f",
      "control-id": "IAC-02.2",
      "description": "Replay-resistant authentication is implemented using time-sensitive tokens, which are generated and validated through a secure, automated process. The system logs each authentication attempt, enabling auditing for any replay attacks."
    },
    {
      "uuid": "d1b1f725-1616-4890-8345-5b0f399c23a0",
      "control-id": "IAC-03",
      "description": "A third-party authentication gateway is utilized to uniquely identify and authenticate all external users and services. This gateway is configured to log all authentication events for auditing purposes."
    },
    {
      "uuid": "b4f5c2d4-9f88-4c43-b6a0-0d9dce6e401f",
      "control-id": "IAC-04",
      "description": "Bidirectional authentication is enforced for all device connections through the use of digital certificates. Each device must present a valid certificate that is verified against the central certificate authority before a connection is established."
    },
    {
      "uuid": "c0c2c2e4-ee5d-4a6a-8f8f-65c1f4fbc3e8",
      "control-id": "IAC-04.1",
      "description": "Upon joining the domain, devices undergo a centralized management process that verifies their identity and compliance through configuration management protocols, ensuring accurate identification and authentication."
    },
    {
      "uuid": "48d1f153-7b8b-4c9f-9a68-693d1f8e2b8c",
      "control-id": "IAC-06",
      "description": "Multi-Factor Authentication (MFA) is enforced for all remote network access and access to third-party applications. Users must provide a second form of verification, such as a one-time passcode sent to their mobile device."
    },
    {
      "uuid": "a9e367e2-0b7a-4c8f-8cd6-7c3b8b2ee5f9",
      "control-id": "IAC-08",
      "description": "Role-Based Access Control (RBAC) is implemented within the application, ensuring that users have access only to the resources necessary for their roles. Access permissions are periodically reviewed and adjusted as needed."
    },
    {
      "uuid": "6ebca36e-6f75-4f3f-9b9a-c1b27de8bdd4",
      "control-id": "IAC-13.1",
      "description": "Single Sign-On (SSO) functionality is provided through integration with the organization's identity provider. Users can access multiple systems without needing to log in separately for each one."
    },
    {
      "uuid": "e1d5e2d1-5e8a-4a0f-b04f-2f2e6a3f3fbb",
      "control-id": "IAC-16",
      "description": "Privileged Account Management (PAM) practices are enforced by restricting access rights for privileged accounts to only those users who have been explicitly authorized by management."
    },
    {
      "uuid": "ed3eeb45-5d41-4e04-8b2f-5c4a6e9f5a3d",
      "control-id": "IAC-20",
      "description": "Logical Access Control (LAC) permissions are enforced based on the principle of least privilege, ensuring users can only access data and systems necessary for their job functions."
    },
    {
      "uuid": "7c5b3e2c-4cd7-4c2e-9b5b-fd1b8b5c3d7e",
      "control-id": "IAC-21",
      "description": "The software implements a least privilege model, ensuring that users are granted access only to the resources that are essential for their specific tasks in accordance with organizational needs."
    },
    {
      "uuid": "3e4e8f9e-1c8a-4c67-a864-7e5d3b2f2bbd",
      "control-id": "IAC-21.3",
      "description": "Privileged accounts are assigned only to personnel and roles approved by management, with a defined approval process documented and enforced."
    },
    {
      "uuid": "f3b2c8e3-cd2d-4b5e-8c4e-8fdc8a6d8a56",
      "control-id": "IAC-22",
      "description": "An account lockout mechanism is implemented to limit consecutive invalid login attempts, automatically locking accounts after a defined number of failed attempts to prevent unauthorized access."
    },
    {
      "uuid": "3a3b6f3a-4f57-479e-8b3b-6f7d3a3e7c77",
      "control-id": "IAC-23",
      "description": "The system limits the number of concurrent sessions for each user account, ensuring that account misuse is minimized and monitored."
    },
    {
      "uuid": "1c5a4f03-8c49-4c6e-b2c3-8c4e9e1b4e94",
      "control-id": "IAC-29",
      "description": "Attribute-Based Access Control (ABAC) is utilized for dynamic authorizations, allowing users access based on specific attributes and contextual information, supporting secure information sharing."
    }
  ]
}
