# Access Controls.Json


{
  "implemented-requirements": [
    {
      "uuid": "d2c8e9f7-4d8c-4e5a-9f4b-6a7c8e1c7a12",
      "control-id": "IAC-01.3",
      "description": "Automated scripts are implemented to maintain an inventory of authorized users and service accounts. These scripts run periodically and cross-reference against the active user database to ensure that only current users are listed. Alerts are generated for any discrepancies found."
    },
    {
      "uuid": "f4e6a1bc-55f0-4e78-b2a1-5a0b0e9d1bfe",
      "control-id": "IAC-02",
      "description": "The software utilizes a centralized authentication service that implements AAA mechanisms for all organizational users. This includes unique user identifiers and logging of authentication attempts for auditing purposes."
    },
    {
      "uuid": "d8c6a2e5-5c4c-4c6b-bb7b-5d9f2e4b7d56",
      "control-id": "IAC-02.2",
      "description": "Replay-resistant authentication is implemented using nonce values and timestamps in authentication requests. Each login attempt requires a unique nonce that is verified against a server-side store to prevent replay attacks."
    },
    {
      "uuid": "e1c8a3f6-6f0e-4a8c-a5b1-5c1a7e2d3a58",
      "control-id": "IAC-03",
      "description": "A third-party user management system is integrated, which includes mechanisms for unique identification and authentication of all non-organizational users. Each access attempt is logged for auditing."
    },
    {
      "uuid": "e7c9a3f8-8f6e-4e3a-b2b1-5c3a3d1e4c2e",
      "control-id": "IAC-04",
      "description": "Bidirectional authentication is enforced for all devices connecting to the system. This involves issuing unique certificates for each device, which must be presented during the connection process to verify identity."
    },
    {
      "uuid": "b1d3e4f5-9a1d-4e4c-b9a8-5b5e1c5f7b1f",
      "control-id": "IAC-04.1",
      "description": "Device onboarding is managed through a centralized configuration management system. This system verifies device identity and ensures compliance with security policies before allowing systems to join the domain."
    },
    {
      "uuid": "a2c4b5f6-1f1e-4e5a-b9a4-5f6c2f3d9e4e",
      "control-id": "IAC-06",
      "description": "Multi-Factor Authentication (MFA) is enforced for all remote access, third-party systems, and non-console access to critical systems. Users must provide a password and a one-time code generated by an authenticator app."
    },
    {
      "uuid": "c3d5e6f7-2e2f-4e4b-b8a3-5c4a3b1e5b1a",
      "control-id": "IAC-08",
      "description": "Role-Based Access Control (RBAC) policies are implemented to enforce need-to-know access for users. Access permissions are reviewed quarterly to ensure compliance with the organization's access control policies."
    },
    {
      "uuid": "d4e6f7a8-3f3e-4e5a-b8b2-5c5e1c3d8e1f",
      "control-id": "IAC-13.1",
      "description": "Single Sign-On (SSO) capability is provided through integration with an identity provider that supports SAML and OAuth protocols. This allows users to authenticate once and gain access to multiple systems."
    },
    {
      "uuid": "e5f7a8b9-4e4f-4e3b-b8a1-5d6e2c4f1a5e",
      "control-id": "IAC-16",
      "description": "Privileged access rights are managed through a Privileged Account Management (PAM) system that restricts access based on role and requires approval for any elevation of privileges."
    },
    {
      "uuid": "f6a8b9c0-5f5d-4e4b-b8b9-5c7e3a5d1a6f",
      "control-id": "IAC-20",
      "description": "Logical Access Control (LAC) permissions are enforced according to the principle of least privilege. Access rights are regularly reviewed and adjusted to ensure compliance."
    },
    {
      "uuid": "b7c9d0e1-6a6e-4e5c-b8a7-5e8f1c5e2a8b",
      "control-id": "IAC-21",
      "description": "The software implements the least privilege principle by ensuring that users have access only to the resources necessary for their roles. This is managed through a centralized access control system."
    },
    {
      "uuid": "c8d0e1f2-7b7f-4e4b-b8a8-5f9e2c6f3a9c",
      "control-id": "IAC-21.3",
      "description": "Privileged accounts are restricted to management-approved personnel. A dedicated system tracks and logs the assignment of privileged accounts to ensure compliance."
    },
    {
      "uuid": "d9e1f2g3-8c8g-4e5d-b9a9-5a0f1d7e4b0e",
      "control-id": "IAC-22",
      "description": "An account lockout mechanism is in place that enforces a limit on consecutive invalid login attempts. Accounts are automatically locked after a predefined number of failed attempts and require administrative intervention to unlock."
    },
    {
      "uuid": "e0f2g3h4-9d9h-4e4e-b9b1-5a1g3d8e5c1f",
      "control-id": "IAC-23",
      "description": "The system limits the number of concurrent sessions for each user account. This is enforced at the application level, preventing multiple simultaneous logins from the same account."
    },
    {
      "uuid": "f1g3h4i5-a0a0-4e5f-b8b8-5b2h4e9f1d2g",
      "control-id": "IAC-29",
      "description": "Attribute-Based Access Control (ABAC) is implemented to provide policy-driven, dynamic authorizations. This allows for flexible access control based on user attributes and contextual information."
    }
  ]
}
